Tekla Open API Reference for Tekla Structures 2025
GridLine.StartLabel Property
 The beginning of the grid line, contains the grid label and position information. For more information see GridLine.GridLabel.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public GridLine.GridLabel StartLabel { get; set; }
Public Property StartLabel As GridLine.GridLabel
	Get
	Set
Property Value
Type: GridLine.GridLabel
See Also
Reference
GridLine Class
Tekla.Structures.Drawing Namespace